(this["webpackJsonpzsgk-pc"] = this["webpackJsonpzsgk-pc"] || []).push([[50], {
    10: function (e, t, n) {
        "use strict";
        n.d(t, "K", (function () {
            return i
        })), n.d(t, "t", (function () {
            return a
        })), n.d(t, "k", (function () {
            return o
        })), n.d(t, "u", (function () {
            return c
        })), n.d(t, "o", (function () {
            return r
        })), n.d(t, "R", (function () {
            return s
        })), n.d(t, "p", (function () {
            return l
        })), n.d(t, "V", (function () {
            return u
        })), n.d(t, "gb", (function () {
            return p
        })), n.d(t, "W", (function () {
            return _
        })), n.d(t, "S", (function () {
            return E
        })), n.d(t, "E", (function () {
            return S
        })), n.d(t, "F", (function () {
            return O
        })), n.d(t, "cb", (function () {
            return A
        })), n.d(t, "G", (function () {
            return d
        })), n.d(t, "q", (function () {
            return I
        })), n.d(t, "r", (function () {
            return L
        })), n.d(t, "s", (function () {
            return g
        })), n.d(t, "l", (function () {
            return T
        })), n.d(t, "m", (function () {
            return C
        })), n.d(t, "Q", (function () {
            return f
        })), n.d(t, "b", (function () {
            return v
        })), n.d(t, "a", (function () {
            return h
        })), n.d(t, "O", (function () {
            return m
        })), n.d(t, "db", (function () {
            return B
        })), n.d(t, "Y", (function () {
            return R
        })), n.d(t, "j", (function () {
            return N
        })), n.d(t, "ab", (function () {
            return k
        })), n.d(t, "U", (function () {
            return b
        })), n.d(t, "bb", (function () {
            return D
        })), n.d(t, "D", (function () {
            return j
        })), n.d(t, "hb", (function () {
            return H
        })), n.d(t, "P", (function () {
            return P
        })), n.d(t, "I", (function () {
            return y
        })), n.d(t, "jb", (function () {
            return w
        })), n.d(t, "z", (function () {
            return M
        })), n.d(t, "L", (function () {
            return z
        })), n.d(t, "M", (function () {
            return U
        })), n.d(t, "v", (function () {
            return G
        })), n.d(t, "lb", (function () {
            return x
        })), n.d(t, "C", (function () {
            return V
        })), n.d(t, "kb", (function () {
            return Y
        })), n.d(t, "N", (function () {
            return F
        })), n.d(t, "H", (function () {
            return K
        })), n.d(t, "eb", (function () {
            return W
        })), n.d(t, "f", (function () {
            return Z
        })), n.d(t, "e", (function () {
            return q
        })), n.d(t, "X", (function () {
            return J
        })), n.d(t, "i", (function () {
            return Q
        })), n.d(t, "Z", (function () {
            return X
        })), n.d(t, "g", (function () {
            return $
        })), n.d(t, "ib", (function () {
            return ee
        })), n.d(t, "w", (function () {
            return te
        })), n.d(t, "h", (function () {
            return ne
        })), n.d(t, "J", (function () {
            return ie
        })), n.d(t, "x", (function () {
            return ae
        })), n.d(t, "c", (function () {
            return oe
        })), n.d(t, "d", (function () {
            return ce
        })), n.d(t, "T", (function () {
            return re
        })), n.d(t, "A", (function () {
            return se
        })), n.d(t, "B", (function () {
            return le
        })), n.d(t, "fb", (function () {
            return ue
        })), n.d(t, "n", (function () {
            return pe
        })), n.d(t, "y", (function () {
            return _e
        }));
        var i = "页面跳转", a = "LIST_DATA_LV", o = "HISTORY_URL", c = "LIST_DEMOLIST", r = "IS_BACK",
            s = "SCHOOL_COOKIE", l = "IS_LOCATION", u = "SCORE_SEARCH_SCHOOL", p = "TOTAL_SEARCH_SCHOOL",
            _ = "SELECT_SCHOOL", E = "SCHOOL_SEARCH", S = "PROFESSION_DATA", O = "PROFESSION_FOR_SCHOOL",
            A = "SUBJECT_FOR_SPECIALTY", d = "PROFESSION_FOR_SPECIALTY", I = "LINEPROVINCE", L = "LINESCHOOL",
            g = "LINESPECIALTY", T = "HOTSCHOOL", C = "HOTSPECIALTY", f = "SCHOOLINFO", v = "ADPARAM", h = "ADDATA",
            m = "SCHOOLADDATA", B = "TJADDATA", R = "SHOWCOL", N = "FLKSTITLE", k = "SINGLETITLE",
            b = "SCHOOL_TAB_SINGLETITLE", D = "SPECIAL_TYPE_ZS", j = "PARTNERDATA", H = "TZYTITLE", P = "SCHOOLHEATNUM",
            y = "RECOMMENDDATA", w = "USERID", M = "MYUSER_MESSAGE", z = "RIGHTSAMESCORE", U = "RIGHTSIMILARSCORE",
            G = "LOCAL_PROVINCE", x = "ZHIYUAN_DATA", V = "NO_DATA", Y = "VIDEO_REMOND", F = "SAVE_LEVEL3",
            K = "PROFESSION_VIDEO", W = "TOP_AD", Z = "BOGUS_COLLEGES", q = "BDZHC_SORT", J = "SET_ISAI",
            Q = "DOWN_ISANI", X = "SINGLEINFO", $ = "COLLECTSCHOOL", ee = "UNREAD", te = "LOGINBOX",
            ne = "CONTROLASKENTER", ie = "RECOMMENDSCHOOLID", ae = "LOGIN_RECRUIT_ALERT", oe = "ART_CONFIG",
            ce = "ART_OR_SINGLE", re = "SCHOOL_SPECIAL_NAME", se = "NATIONAL_BK_DETAIL", le = "NATION_OPERATE",
            ue = "TOP_WEIGHT_OPERATE", pe = "ID_3_OPERATE", _e = "MODAL_STATE"
    }, 143: function (e, t, n) {
        "use strict";
        n.d(t, "a", (function () {
            return c
        })), n.d(t, "b", (function () {
            return s
        }));
        var i = n(7), a = n(1);
        t = n(19), n.n(t), n(28), n(6), n(4);
        var o = n(5), c = function () {
            return {fps: Object(o.u)("fps"), fpsnum: Object(o.u)("fpsnum")}
        }, r = (n(361), n(13)), s = function () {
            var e = Object(r.d)((function (e) {
                    return e.getUserInfo.data
                })), t = Object(a.useState)(!1), n = (l = Object(i.a)(t, 2))[0], c = l[1], s = Object(a.useState)(!1),
                l = (t = Object(i.a)(s, 2))[0], u = t[1],
                p = (s = Object(a.useState)({}), s = (t = Object(i.a)(s, 2))[0], t[1]);
            return Object(a.useEffect)((function () {
                var t;
                null != e && e.province && (t = e.entrant_type, c("2" !== String(t)), u("2" === String(t)), t = (null === (t = Object(o.i)().year_arr) || void 0 === t ? void 0 : t.find((function (t) {
                    return String(t.id) === String(null == e ? void 0 : e.year)
                }))) || {}, p(t))
            }), [e]), {isNormalSingleType: n, isCurrentArtType: l, currentGrade: s}
        }
    }, 1721: function (e, t, n) {
        "use strict";
        n.r(t);
        var i = n(45), a = n(51), o = n(69), c = n(68), r = n(910), s = (n.n(r), n(961)), l = (n.n(s), n(1)),
            u = n.n(l), p = n(24), _ = n.n(p), E = n(137), S = n(13), O = n(79), A = n(233), d = n(9),
            I = (t = n.n(d), r = n(813), s = n(29), n(5)), L = (l = n(4), n(14)), g = (p = n(0), n.n(p), n(1719));
        n(1720), g.init({
            apikey: "d98da203fbfdab58cc7929d9675ff5bad3bbcb91b1c442f59ea603ea6a5e5b25",
            appversion: "".concat((new Date).getFullYear()).concat((new Date).getMonth() + 1).concat((new Date).getDate()),
            silentDev: !0,
            setHttpBody: !0,
            silentConsole: !1,
            sampleRate: .4,
            maxRevideoSizeInByte: "500",
            breadcrumbSize: 30,
            filters: [{message: /Script error/}, {res: {status: /^404$/}}, {
                type: /httpError/,
                req: {url: /px.effirst.com/}
            }, {type: /httpError/, req: {url: /tags.growingio.com/}}, {
                type: /httpError/,
                req: {url: /baidu.com/}
            }, {type: /httpError/, req: {url: /hm.baidu.com/}}, {type: /httpError/, req: {url: /cnzz.com/}}]
        }), window.localStorage.getItem("resigerFlag") && (window.localStorage.removeItem("resigerFlag"), Object(I.j)()), (d = Object(I.u)("fromcoop")) && (localStorage.removeItem("fromcoop"), sessionStorage.setItem("fromcoop", d)), t.a.get("_token.common") && t.a.set("_token.gaokao", t.a.get("_token.common"), {
            expires: 30,
            domain: l.a.DO_MAIN
        }), sessionStorage.removeItem("schoolToXyq");
        var T;
        n = t.a.get("fillVolunteerData"), d = t.a.get("whitch_edit");
        n && n != d && "null" != n && "{}" != n && (t.a.remove("userInfoExpires", {domain: l.a.DO_MAIN}), localStorage.removeItem("allUserInfo"), (n = JSON.parse(n)).provinceid && (window.localStorage.setItem("localprovinceid", n.provinceid), window.localStorage.setItem("localprovincename", n.cityname), window.localStorage.setItem("birthplace", JSON.stringify({
            id: n.provinceid,
            name: n.province
        }))), 0 < (T = n.subjects ? n.subjects.split(",") : []).length && (T = 1 == T.length ? "理科" == T[0] ? 1 : 2 : s.a.subject_list.filter((function (e) {
            return T.some((function (t) {
                return t === e.name
            }))
        })).map((function (e) {
            return e.code
        })).join(","), localStorage.setItem("subject", T)), n.score && localStorage.setItem("score", n.score), n.ranks && localStorage.setItem("rank", n.ranks), t.a.get("fillVolunteerData") && t.a.set("whitch_edit", t.a.get("fillVolunteerData"), {
            expires: 30,
            domain: l.a.DO_MAIN
        })), t.a.get("originLoginKey") || Object(I.j)(!1);
        u = function (e) {
            Object(o.a)(n, e);
            var t = Object(c.a)(n);

            function n(e) {
                return Object(i.a)(this, n), (e = t.call(this, e)).state = {hasError: !1}, e
            }

            return Object(a.a)(n, [{
                key: "componentDidCatch", value: function (e, t) {
                    this.setState({hasError: !0}), g.notifyError(e, {metaData: {info: t}})
                }
            }, {
                key: "render", value: function () {
                    return this.state.hasError ? null : this.props.children
                }
            }]), n
        }(u.a.Component);

        function C() {
            Object(L.E)(), Object(L.j)(2, "ad_2frame_key");
            var e = A.a.location.pathname;
            JSON.parse(JSON.stringify(e)).replace(/[\d一-龥]+/g, "*").includes("/school/*") || sessionStorage.removeItem("schoolArtType"), Object(I.F)("https://s96.cnzz.com/z_stat.php?id=4696252&web_id=4696252")
        }

        A.a.listen(C), C(), _.a.render(Object(p.jsx)(u, {
            children: Object(p.jsx)(S.a, {
                store: O.a,
                children: Object(p.jsx)(E.b, {history: A.a, children: Object(p.jsx)(E.a, {component: r.a})})
            })
        }), document.getElementById("root"))
    }, 29: function (e, t, n) {
        "use strict";
        t.a = {
            provincePY: {
                11: "bj",
                12: "tj",
                13: "hb",
                14: "sx",
                15: "nm",
                21: "ln",
                22: "jl",
                23: "hlj",
                31: "sh",
                32: "js",
                33: "zj",
                34: "ah",
                35: "fj",
                36: "jx",
                37: "sd",
                41: "hen",
                42: "hub",
                43: "hun",
                44: "gd",
                45: "gx",
                46: "hn",
                50: "cq",
                51: "sc",
                52: "gz",
                53: "yn",
                54: "xz",
                61: "shanx",
                62: "gs",
                63: "qh",
                64: "nx",
                65: "xj"
            },
            provincePYZH: {
                bj: 11,
                tj: 12,
                hb: 13,
                sx: 14,
                nm: 15,
                ln: 21,
                jl: 22,
                hlj: 23,
                sh: 31,
                js: 32,
                zj: 33,
                ah: 34,
                fj: 35,
                jx: 36,
                sd: 37,
                hen: 41,
                hub: 42,
                hun: 43,
                gd: 44,
                gx: 45,
                hn: 46,
                cq: 50,
                sc: 51,
                gz: 52,
                yn: 53,
                xz: 54,
                shanx: 61,
                gs: 62,
                qh: 63,
                nx: 64,
                xj: 65
            },
            province: {
                11: "北京",
                12: "天津",
                13: "河北",
                14: "山西",
                15: "内蒙古",
                21: "辽宁",
                22: "吉林",
                23: "黑龙江",
                31: "上海",
                32: "江苏",
                33: "浙江",
                34: "安徽",
                35: "福建",
                36: "江西",
                37: "山东",
                41: "河南",
                42: "湖北",
                43: "湖南",
                44: "广东",
                45: "广西",
                46: "海南",
                50: "重庆",
                51: "四川",
                52: "贵州",
                53: "云南",
                54: "西藏",
                61: "陕西",
                62: "甘肃",
                63: "青海",
                64: "宁夏",
                65: "新疆",
                81: "香港",
                82: "澳门",
                71: "台湾",
                99: "其它",
                100: "不分省",
                0: "其它"
            },
            kelei: {
                93: "科类22",
                92: "字段3",
                91: "字段2",
                90: "字段",
                88: "无批次",
                87: "特殊类批",
                86: "本科提前批C段",
                85: "免费师范生批",
                84: "自主招生批",
                83: "专项计划本科二批（贫困专项、南疆单列、对口援疆计划本科二批次）",
                82: "专项计划本科一批（贫困专项、南疆单列、对口援疆计划本科一批次）",
                81: "高校专项批",
                79: "地方专项批",
                76: "提前专项批",
                74: "国家专项批",
                71: "地方农村专项计划本科批",
                70: "本科零批",
                69: "本科综合评价批",
                66: "本科乙批",
                65: "本科甲批",
                64: "地方专项计划本科二批",
                63: "地方专项计划本科一批",
                62: "国家专项计划本科二批",
                61: "国家专项计划本科一批",
                60: "精准脱贫专项计划（专科）",
                59: "精准脱贫专项计划（本科）",
                58: "本科第二批预科B",
                57: "本科第二批预科A",
                56: "本科第一批预科",
                55: "艺术本科第一批专项",
                54: "本科二批C段",
                53: "本科第一批专项",
                52: "本科一批B段",
                51: "本科一批A段",
                50: "单设本科批次",
                49: "专科批B段",
                48: "专科批A段",
                47: "本科批B段",
                46: "本科批A段",
                45: "本科二批B段",
                44: "本科二批A段",
                43: "专项批",
                42: "本科提前批自主招生",
                41: "本科提前一批",
                40: "本科提前二批",
                39: "提前批专项计划",
                38: "普通类平行录取段",
                37: "本科提前批B段",
                36: "本科提前批A段",
                35: "新增批次",
                34: "蒙授艺术",
                33: "蒙授理科",
                32: "蒙授文科",
                31: "蒙授体育",
                30: "民语言艺术类",
                29: "民语言理科",
                28: "民语言文科",
                27: "民语言体育类",
                26: "艺术理",
                25: "艺术文",
                24: "体育理",
                23: "体育文",
                20: "专科二批",
                19: "专科一批",
                18: "平行录取三段",
                17: "平行录取二段",
                16: "平行录取一段",
                15: "普通类提前批",
                14: "本科批",
                13: "地方专项计划本科批",
                12: "国家专项计划本科批",
                11: "专科提前批",
                10: "专科批",
                9: "本科三批",
                8: "本科二批",
                7: "本科一批",
                6: "本科提前批",
                5: "体育类",
                4: "艺术类",
                3: "综合",
                2: "文科",
                1: "理科"
            },
            provinceZH: {
                "北京": 11,
                "天津": 12,
                "河北": 13,
                "山西": 14,
                "内蒙古": 15,
                "辽宁": 21,
                "吉林": 22,
                "黑龙江": 23,
                "上海": 31,
                "江苏": 32,
                "浙江": 33,
                "安徽": 34,
                "福建": 35,
                "江西": 36,
                "山东": 37,
                "河南": 41,
                "湖北": 42,
                "湖南": 43,
                "广东": 44,
                "广西": 45,
                "海南": 46,
                "重庆": 50,
                "四川": 51,
                "贵州": 52,
                "云南": 53,
                "西藏": 54,
                "陕西": 61,
                "甘肃": 62,
                "青海": 63,
                "宁夏": 64,
                "新疆": 65,
                "香港": 81,
                "澳门": 82,
                "台湾": 71,
                "不分省": 100,
                "其它": 0
            },
            recom: {"全部": 0, "概率小": 1, "概率中": 2, "概率大": 3},
            batch: {
                "全部": "",
                "本科提前批": 6,
                "本科一批": 7,
                "本科二批": 8,
                "本科三批": 9,
                "专科批": 10,
                "专科提前批": 11,
                "国家专项计划本科批": 12,
                "地方专项计划本科批": 13,
                "本科批": 14,
                "普通类提前批": 15,
                "平行录取一段": 16,
                "平行录取二段": 17,
                "平行录取三段": 18,
                "专科一批": 19,
                "专科二批": 20,
                "无批次": 88
            },
            school_type: {
                "普通本科": "6000",
                "专科（高职）": "6001",
                "独立学院": "6002",
                "中外合作办学": "36002",
                "内地与港澳台地区合作办学": "36003",
                "公办": "36000",
                "民办": "36001"
            },
            school_character: {
                985: {f985: 1},
                211: {f211: 1},
                "双一流": {is_dual_class: 1},
                "教育部直属": {department: 1},
                "中央部委": {central: 1},
                "强基计划": {admissions: 1},
                "双高计划": {is_doublehigh: 1}
            },
            education_type: {
                "普通本科": {school_type: 6e3},
                "专科（高职）": {school_type: 6001},
                "公办": {nature: 36e3},
                "民办": {nature: 36001},
                "中外合作办学": {nature: 36002},
                "内地与港澳台地区合作办学": {nature: 36003}
            },
            registration_risk: {"概率小": 1, "概率中": 2, "概率大": 3},
            school_nature: {
                6e3: "普通本科",
                6001: "专科（高职）",
                6002: "独立学院",
                6003: "中外合作办学",
                36e3: "公办",
                36001: "民办",
                36002: "中外合作办学",
                36003: "内地与港澳台地区合作办学"
            },
            yuanxiao: {
                "综合": 5e3,
                "理工": 5001,
                "农林": 5002,
                "医药": 5003,
                "师范": 5004,
                "语言": 5005,
                "财经": 5006,
                "政法": 5007,
                "体育": 5008,
                "艺术": 5009,
                "民族": 5010,
                "军事": 5011,
                "其他": 5012
            },
            yuanxiaoType: {
                5e3: "综合",
                5001: "理工",
                5002: "农林",
                5003: "医药",
                5004: "师范",
                5005: "语言",
                5006: "财经",
                5007: "政法",
                5008: "体育",
                5009: "艺术",
                5010: "民族",
                5011: "军事",
                5012: "其他"
            },
            zycc: {"本科": 1, "专科": 2, "专科（高职）": 2, "全部": ""},
            zylb: {
                "文学类": 7,
                "理学类": 9,
                "哲学类": 3,
                "教育学类": 6,
                "管理学类": 13,
                "经济学类": 4,
                "能源动力与材料大类": 17,
                "农学类": 11,
                "工学类": 10,
                "医学类": 12,
                "历史学类": 8,
                "法学类": 5,
                "艺术学类": 14,
                "文学": 7,
                "理学": 9,
                "哲学": 3,
                "教育学": 6,
                "管理学": 13,
                "经济学": 4,
                "能源动力与材料大": 17,
                "农学": 11,
                "工学": 10,
                "医学": 12,
                "历史学": 8,
                "法学": 5,
                "艺术学": 14,
                "交通运输大类": 24,
                "生物与化工大类": 21,
                "资源开发与测绘类": 1,
                "资源环境与安全大类": 16,
                "土木建筑大类": 18,
                "水利大类": 19,
                "装备制造大类": 20,
                "电子信息大类": 25,
                "环保、气象与安全类": 16,
                "财经商贸大类": 27,
                "医药卫生大类": 26,
                "旅游类": 28,
                "公共管理与服务大类": 33,
                "旅游大类": 28,
                "文化艺术大类": 29,
                "新闻传播大类": 30,
                "教育与体育大类": 31,
                "公安与司法大类": 32,
                "轻工纺织大类": 22,
                "农林牧渔类": 15,
                "农林牧渔大类": 15
            },
            stuleibie: {
                "物理类": "2073",
                "历史类": "2074",
                "理科": "1",
                "文科": "2",
                "综合": "3",
                "艺术类": "4",
                "体育类": "5",
                "本科提前批": "6",
                "本科一批": "7",
                "本科二批": "8",
                "本科三批": "9",
                "专科批": "10",
                "专科提前批": "11",
                "国家专项计划本科批": "12",
                "地方专项计划本科批": "13",
                "本科批": "14",
                "普通类提前批": "15",
                "平行录取一段": "16",
                "平行录取二段": "17",
                "平行录取三段": "18",
                "专科一批": "19",
                "专科二批": "20",
                "体育文": "23",
                "体育理": "24",
                "艺术文": "25",
                "艺术理": "26",
                "民语言体育类": "27",
                "民语言文科": "28",
                "民语言理科": "29",
                "民语言艺术类": "30",
                "蒙授体育": "31",
                "蒙授文科": "32",
                "蒙授理科": "33",
                "蒙授艺术": "34",
                "本科提前批A段": "36",
                "本科提前批B段": "37",
                "普通类平行录取段": "38",
                "提前批专项计划": "39",
                "本科提前二批": "40",
                "本科提前一批": "41",
                "本科提前批自主招生": "42",
                "专项批": "43",
                "本科二批A段": "44",
                "本科二批B段": "45",
                "本科批A段": "46",
                "本科批B段": "47",
                "专科批A段": "48",
                "专科批B段": "49",
                "单设本科批次": "50",
                "本科一批A段": "51",
                "本科一批B段": "52",
                "本科第一批专项": "53",
                "本科二批C段": "54",
                "艺术本科第一批专项": "55",
                "本科第一批预科": "56",
                "本科第二批预科A": "57",
                "本科第二批预科B": "58",
                "精准脱贫专项计划（本科）": "59",
                "精准脱贫专项计划（专科）": "60",
                "国家专项计划本科一批": "61",
                "国家专项计划本科二批": "62",
                "地方专项计划本科一批": "63",
                "地方专项计划本科二批": "64",
                "本科甲批": "65",
                "本科乙批": "66",
                "本科综合评价批": "69",
                "本科零批": "70",
                "地方农村专项计划本科批": "71",
                "国家专项批": "74",
                "提前专项批": "76",
                "地方专项批": "79",
                "高校专项批": "81",
                "专项计划本科一批（贫困专项、南疆单列、对口援疆计划本科一批次）": "82",
                "专项计划本科二批（贫困专项、南疆单列、对口援疆计划本科二批次）": "83",
                "自主招生批": "84",
                "免费师范生批": "85",
                "本科提前批C段": "86",
                "特殊类批": "87",
                "无批次": "88",
                "上海海关学院": "89",
                "特殊类型招生批": "90",
                "本一特殊类型招生批": "91",
                "地方专项计划批": "92",
                "本二特殊类型招生批": "93",
                "农村专项计划批": "94",
                "本科普通批A": "95",
                "本科普通批B": "96",
                "本科“专项生”批": "97",
                "本科一批A1段": "98",
                "国家专项计划批": "99",
                "本科三批A段": "100",
                "专项计划批": "101",
                "本科一批预科班": "102",
                "精准脱贫专项计划本科批": "103",
                "本科二批预科A类": "104",
                "本科二批预科B类": "105",
                "本科二批预科班": "106",
                "专科预科班": "107",
                "贫困专项、南疆单列、对口援疆计划本科一批": "108",
                "贫困专项、南疆单列、对口援疆计划本科二批": "109",
                "本科一批H段（特殊类型招生批）": "110",
                "本科一批I段": "111",
                "本科一批J段": "112",
                "本科二批K段": "113",
                "本科二批L段": "114",
                "本科三批M段": "115",
                "本科三批N段": "116",
                "高职（专科）批P段": "117",
                "高职（专科）批Q段": "118",
                "高职（专科）批R段": "119",
                "高职（专科）批S段": "120",
                "省内预科": "121",
                "本科二批及预科班": "122",
                "艺术A类（本科）": "123",
                "艺术B类（本科）": "124",
                "艺术类（高职专科）": "125",
                "体育类（本科）": "126",
                "体育类（高职专科）": "127",
                "艺术类（本科）": "128",
                "自招线": "129",
                "体育类（本科一批）": "130",
                "体育类（本科二批）": "131",
                "军校军检线": "132",
                "体育类（本、专科）": "133",
                "专科批（独立学院、民办）": "134",
                "体育类（平行录取一段）": "135",
                "体育类（平行录取二段）": "136",
                "汉授体育": "137",
                "汉授美术": "138",
                "蒙授美术": "139",
                "汉授音乐": "140",
                "蒙授音乐": "141",
                "汉授编导": "142",
                "其他艺术": "143",
                "蒙授其他艺术": "144",
                "高分优先投档线": "145",
                "艺术类（本科一批）": "146",
                "艺术类（本科二批）": "147",
                "贫困地区专项计划（本科一批）": "148",
                "贫困地区专项计划（本科二批）": "149",
                "省外院校民族班、民族预科（本科一批）": "150",
                "省外院校民族班、民族预科（本科二批）": "151",
                "省内专项（本科一批）": "152",
                "省内专项（本科二批）": "153",
                "省内院校本科民族预科": "154",
                "体育类（本科三批）": "155",
                "蒙授本科一批": "156",
                "蒙授本科二批": "157",
                "蒙授高职高专": "158",
                "重点本科批": "161",
                "普通本科批（少）": "160",
                "重点本科批（少）": "162",
                "普通本科批": "163",
                "专科批（汉）": "164",
                "专科批（少）": "165",
                "艺术类本科批（汉）": "166",
                "艺术类本科批（少）": "167",
                "艺术类（专科）": "168",
                "体育类本科批（汉）": "169",
                "体育类本科批（少）": "170",
                "体育类（专科）": "171",
                "体育类（本科提前批）": "172",
                "体育类（专科提前批）": "175",
                "艺术类（本科提前批）": "174",
                "艺术类（专科提前批）": "176",
                "本科一批（A+A）": "177",
                "本科一批（AA）": "178",
                "本科一批（AB）": "179",
                "本科一批（AB+）": "180",
                "本科一批（B+B）": "181",
                "本科一批（B+B+）": "182",
                "本科一批（BB）": "183",
                "本科一批（BC）": "184",
                "本科一批（历史A，另一门B）": "185",
                "本科一批（历史A，另一门B+）": "186",
                "本科一批（历史B+，另一门B）": "187",
                "本科一批（物理A，另一门B）": "188",
                "本科一批（物理A，另一门B+）": "189",
                "本科一批（物理B+，另一门B）": "190",
                "本科批（高分优先投档线）": "191",
                "地方专项计划本科批（高分优先投档线）": "192",
                "本科二批（B+B）": "193",
                "本科二批（B+B+）": "194",
                "本科二批（BB）": "195",
                "本科二批（BC）": "196",
                "本科二批（CC）": "197",
                "本科二批（历史B，另一门C）": "198",
                "本科二批（历史B+，另一门B）": "199",
                "本科二批（物理B，另一门C）": "200",
                "本科二批（物理B+，另一门B）": "201",
                "本科批（最低分数线）": "202",
                "本科一批B": "203",
                "专科批（CC）": "204",
                "专科批（DD）": "205",
                "专科批（CD）": "206"
            },
            year: {2019: 2019, 2018: 2018, 2017: 2017, 2016: 2016, 2015: 2015, 2014: 2014, 2013: 2013},
            school_typeZH: {6e3: "普通本科", 6001: "专科（高职）", 6002: "独立学院", 6003: "中外合作办学", 6007: "其他"},
            fenlei_typeZH: {2001: "普通本科", 2002: "专科（高职）"},
            educational_level: {"普通本科": 2001, "专科（高职）": 2002},
            batchZH: {
                6: "本科提前批",
                7: "本科一批",
                8: "本科二批",
                9: "本科三批",
                10: "专科批",
                11: "专科提前批",
                12: "国家专项计划本科批",
                13: "地方专项计划本科批",
                14: "本科批",
                15: "普通类提前批",
                16: "平行录取一段",
                17: "平行录取二段",
                18: "平行录取三段",
                19: "专科一批",
                20: "专科二批",
                88: "无批次"
            },
            stuleibieZH: {
                2073: "物理类",
                2074: "历史类",
                206: "专科批（CD）",
                205: "专科批（DD）",
                204: "专科批（CC）",
                203: "本科一批B",
                202: "本科批（最低分数线）",
                201: "本科二批（物理B+，另一门B）",
                200: "本科二批（物理B，另一门C）",
                199: "本科二批（历史B+，另一门B）",
                198: "本科二批（历史B，另一门C）",
                197: "本科二批（CC）",
                196: "本科二批（BC）",
                195: "本科二批（BB）",
                194: "本科二批（B+B+）",
                193: "本科二批（B+B）",
                192: "地方专项计划本科批（高分优先投档线）",
                191: "本科批（高分优先投档线）",
                190: "本科一批（物理B+，另一门B）",
                189: "本科一批（物理A，另一门B+）",
                188: "本科一批（物理A，另一门B）",
                187: "本科一批（历史B+，另一门B）",
                186: "本科一批（历史A，另一门B+）",
                185: "本科一批（历史A，另一门B）",
                184: "本科一批（BC）",
                183: "本科一批（BB）",
                182: "本科一批（B+B+）",
                181: "本科一批（B+B）",
                180: "本科一批（AB+）",
                179: "本科一批（AB）",
                178: "本科一批（AA）",
                177: "本科一批（A+A）",
                176: "艺术类（专科提前批）",
                175: "体育类（专科提前批）",
                174: "艺术类（本科提前批）",
                173: "体育类（专科提前批）",
                172: "体育类（本科提前批）",
                171: "体育类（专科）",
                170: "体育类本科批（少）",
                169: "体育类本科批（汉）",
                168: "艺术类（专科）",
                167: "艺术类本科批（少）",
                166: "艺术类本科批（汉）",
                165: "专科批（少）",
                164: "专科批（汉）",
                163: "普通本科批",
                162: "重点本科批（少）",
                161: "重点本科批",
                160: "普通本科批（少）",
                159: "重点本科批",
                158: "蒙授高职高专",
                157: "蒙授本科二批",
                156: "蒙授本科一批",
                155: "体育类（本科三批）",
                154: "省内院校本科民族预科",
                153: "省内专项（本科二批）",
                152: "省内专项（本科一批）",
                151: "省外院校民族班、民族预科（本科二批）",
                150: "省外院校民族班、民族预科（本科一批）",
                149: "贫困地区专项计划（本科二批）",
                148: "贫困地区专项计划（本科一批）",
                147: "艺术类（本科二批）",
                146: "艺术类（本科一批）",
                145: "高分优先投档线",
                144: "蒙授其他艺术",
                143: "其他艺术",
                142: "汉授编导",
                141: "蒙授音乐",
                140: "汉授音乐",
                139: "蒙授美术",
                138: "汉授美术",
                137: "汉授体育",
                136: "体育类（平行录取二段）",
                135: "体育类（平行录取一段）",
                134: "专科批（独立学院、民办）",
                133: "体育类（本、专科）",
                132: "军校军检线",
                131: "体育类（本科二批）",
                130: "体育类（本科一批）",
                129: "自招线",
                128: "艺术类（本科）",
                127: "体育类（高职专科）",
                126: "体育类（本科）",
                125: "艺术类（高职专科）",
                124: "艺术B类（本科）",
                123: "艺术A类（本科）",
                122: "本科二批及预科班",
                121: "省内预科",
                120: "高职（专科）批S段",
                119: "高职（专科）批R段",
                118: "高职（专科）批Q段",
                117: "高职（专科）批P段",
                116: "本科三批N段",
                115: "本科三批M段",
                114: "本科二批L段",
                113: "本科二批K段",
                112: "本科一批J段",
                111: "本科一批I段",
                110: "本科一批H段（特殊类型招生批）",
                109: "贫困专项、南疆单列、对口援疆计划本科二批",
                108: "贫困专项、南疆单列、对口援疆计划本科一批",
                107: "专科预科班",
                106: "本科二批预科班",
                105: "本科二批预科B类",
                104: "本科二批预科A类",
                103: "精准脱贫专项计划本科批",
                102: "本科一批预科班",
                101: "专项计划批",
                100: "本科三批A段",
                99: "国家专项计划批",
                98: "本科一批A1段",
                97: "本科“专项生”批",
                96: "本科普通批B",
                95: "本科普通批A",
                94: "农村专项计划批",
                93: "本二特殊类型招生批",
                92: "地方专项计划批",
                91: "本一特殊类型招生批",
                90: "特殊类型招生批",
                89: "上海海关学院",
                88: "无批次",
                87: "特殊类批",
                86: "本科提前批C段",
                85: "免费师范生批",
                84: "自主招生批",
                83: "专项计划本科二批（贫困专项、南疆单列、对口援疆计划本科二批次）",
                82: "专项计划本科一批（贫困专项、南疆单列、对口援疆计划本科一批次）",
                81: "高校专项批",
                79: "地方专项批",
                76: "提前专项批",
                74: "国家专项批",
                71: "地方农村专项计划本科批",
                70: "本科零批",
                69: "本科综合评价批",
                66: "本科乙批",
                65: "本科甲批",
                64: "地方专项计划本科二批",
                63: "地方专项计划本科一批",
                62: "国家专项计划本科二批",
                61: "国家专项计划本科一批",
                60: "精准脱贫专项计划（专科）",
                59: "精准脱贫专项计划（本科）",
                58: "本科第二批预科B",
                57: "本科第二批预科A",
                56: "本科第一批预科",
                55: "艺术本科第一批专项",
                54: "本科二批C段",
                53: "本科第一批专项",
                52: "本科一批B段",
                51: "本科一批A段",
                50: "单设本科批次",
                49: "专科批B段",
                48: "专科批A段",
                47: "本科批B段",
                46: "本科批A段",
                45: "本科二批B段",
                44: "本科二批A段",
                43: "专项批",
                42: "本科提前批自主招生",
                41: "本科提前一批",
                40: "本科提前二批",
                39: "提前批专项计划",
                38: "普通类平行录取段",
                37: "本科提前批B段",
                36: "本科提前批A段",
                34: "蒙授艺术",
                33: "蒙授理科",
                32: "蒙授文科",
                31: "蒙授体育",
                30: "民语言艺术类",
                29: "民语言理科",
                28: "民语言文科",
                27: "民语言体育类",
                26: "艺术理",
                25: "艺术文",
                24: "体育理",
                23: "体育文",
                20: "专科二批",
                19: "专科一批",
                18: "平行录取三段",
                17: "平行录取二段",
                16: "平行录取一段",
                15: "普通类提前批",
                14: "本科批",
                13: "地方专项计划本科批",
                12: "国家专项计划本科批",
                11: "专科提前批",
                10: "专科批",
                9: "本科三批",
                8: "本科二批",
                7: "本科一批",
                6: "本科提前批",
                5: "体育类",
                4: "艺术类",
                3: "综合",
                2: "文科",
                1: "理科",
                1069: "学考(体育)",
                1068: "学考(广播电视编导)",
                1067: "学考(美术)",
                1066: "学考(文科)",
                1065: "学考(理科)",
                1064: "3+证书(西藏新疆班)",
                1063: "3+证书(退役士兵)",
                1062: "3+证书(中职生)",
                1061: "3+证书(本科)",
                1097: "佛山顺德(中职生)",
                1089: "佛山顺德(退役士兵)",
                1086: "学考其他",
                1085: "学考理",
                1084: "学考文",
                1079: "3+证书",
                1078: "文科(学考)",
                1077: "理科(学考)",
                1071: "学考(音乐)",
                1070: "学考(舞蹈)"
            },
            colleges_level: {
                76001: "国家示范性高等职业院校",
                76002: "国家级骨干",
                76003: "省级示范",
                76004: "现代学徒制试点院校",
                76005: "省级高水平高职学校建设单位",
                76006: "省级高水平高职专业群建设单位"
            },
            single: {
                75001: "高职单招",
                75002: "对口单招",
                75003: "自主招生",
                75004: "春季高考",
                75005: "分类考试",
                75006: "提前招生",
                75007: "高职招考",
                75008: "综合评价"
            },
            nature: {36000: "公办", 36001: "民办"},
            informationType: {
                12001: "高职资讯",
                1: "院校动态",
                2: "招生简章",
                3: "招生计划",
                4: "院校录取",
                12002: "政策解读"
            },
            doublehigh: {
                77001: "高水平学校建设单位（A档）",
                77002: "高水平学校建设单位（B档）",
                77003: "高水平学校建设单位（C档）",
                77004: "高水平专业群建设单位（A档）",
                77005: "高水平专业群建设单位（B档）",
                77006: "高水平专业群建设单位（C档）"
            },
            bothFirstRate: {
                38001: "一流大学建设高校A类",
                38002: "一流大学建设高校B类",
                38e3: "一流学科建设高校",
                38003: ""
            },
            newsType: {
                68009: "招生计划",
                68e3: "招生简章",
                68002: "招生章程",
                68001: "招生快讯",
                68003: "自主招生",
                68004: "特长生招生"
            },
            Intelligence: {
                electiveOld: [14, 15, 22, 23, 34, 36, 41, 45, 51, 52, 53, 54, 61, 62, 63, 64, 65],
                electiveSpecial: [33, 37],
                elective3_1_2: [13, 21, 32, 35, 42, 43, 44, 50],
                elective3_3: [11, 12, 31, 46]
            },
            IntelligenceNewgaokao: {
                electiveOld: [52, 54, 65],
                electiveSpecial: [33, 37],
                elective3_1_2: [13, 21, 50, 32, 35, 42, 43, 44, 23, 62, 22, 34, 36, 45, 14, 41, 61, 15, 51, 53, 64, 63],
                elective3_3: [11, 12, 31, 46]
            },
            Intelligence_spe_group: {
                electiveOld: [14, 15, 22, 23, 34, 36, 41, 45, 51, 52, 53, 54, 61, 62, 63, 64, 65],
                electiveSpecial_33: [33, 37],
                electiveSpecial_312: [13, 21, 50],
                elective3_1_2: [32, 35, 42, 43, 44],
                elective3_3: [11, 12, 31, 46]
            },
            ranlConfig: {
                ruanke_rank: "软科综合",
                xyh_rank: "校友会综合",
                wsl_rank: "武书连",
                qs_world: "QS世界",
                us_rank: "US世界",
                tws_china: "泰晤士"
            },
            subjectType: {
                11: {2020: "A", 2021: "A", 2022: "A"},
                12: {2020: "A", 2021: "A", 2022: "A"},
                13: {2021: "B", 2022: "B"},
                21: {2021: "B", 2022: "B"},
                31: {2017: "A", 2018: "A", 2019: "A", 2020: "A", 2021: "A", 2022: "A"},
                32: {2021: "B", 2022: "B"},
                33: {2017: "A", 2018: "A", 2019: "A", 2020: "A", 2021: "A", 2022: "A"},
                35: {2021: "B", 2022: "B"},
                37: {2020: "A", 2021: "A", 2022: "A"},
                42: {2021: "B", 2022: "B"},
                43: {2021: "B", 2022: "B"},
                44: {2021: "B", 2022: "B"},
                46: {2020: "A", 2021: "A", 2022: "A"},
                50: {2021: "B", 2022: "B"}
            },
            scoreType: {11: "450", 31: "450", 12: "450"},
            educationLevel: {11: "450", 31: "450", 12: "450"},
            special_group: {
                2017: [31],
                2018: [31],
                2019: [31],
                2020: [11, 12, 31, 46],
                2021: [11, 12, 31, 46, 32, 35, 42, 43, 44]
            },
            subject_list: [{id: "6", name: "地理", code: "70005", simpleName: "地"}, {
                id: "1",
                name: "物理",
                code: "70000",
                simpleName: "物",
                type: "2073"
            }, {id: "4", name: "历史", code: "70004", simpleName: "史", type: "2074"}, {
                id: "2",
                name: "化学",
                code: "70001",
                simpleName: "化"
            }, {id: "3", name: "生物", code: "70002", simpleName: "生"}, {
                id: "5",
                name: "政治",
                code: "70003",
                simpleName: "政"
            }, {id: "7", name: "技术", code: "70006", simpleName: "技"}],
            specialParallel: ["山东", "浙江", "重庆", "辽宁", "河北"],
            schoolParallel: ["四川", "江西", "贵州", "吉林", "山西", "内蒙古", "河南", "安徽", "广西", "云南", "甘肃", "青海", "陕西", "宁夏", "新疆", "黑龙江"],
            groupParallel: ["湖南", "广东", "江苏", "湖北", "福建", "海南"],
            otherParallel: ["北京", "天津", "上海"],
            danzhaoType: {
                11: "bj",
                12: "tj",
                13: "hb",
                14: "shx",
                15: "nmg",
                21: "ln",
                22: "jl",
                23: "hlj",
                31: "sh",
                32: "js",
                33: "zj",
                34: "ah",
                35: "fj",
                36: "jx",
                37: "sd",
                41: "hen",
                42: "hub",
                43: "hun",
                44: "gd",
                45: "gx",
                46: "hain",
                50: "cq",
                51: "sc",
                52: "gz",
                53: "yn",
                54: "xz",
                61: "sx",
                62: "gs",
                63: "qh",
                64: "nx",
                65: "xj"
            },
            zhineng_choose_dic: {
                electiveOld: [14, 15, 41, 51, 53, 54, 61, 63, 64, 65],
                electiveSpecial_33: [33, 37],
                electiveSpecial_312: [13, 21, 50],
                elective3_1_2: [32, 35, 42, 43, 44, 23, 62, 22, 34, 36, 52, 45],
                elective3_3: [11, 12, 31, 46]
            },
            new_pro_3_1_2: ["23", "62", "22", "34", "36", "52", "45"]
        }
    }, 361: function (e, t, n) {
        "use strict";
        var i = n(7), a = n(1), o = (n.n(a), n(177)), c = n.n(o), r = function () {
            return {
                xScroll: window.pageXOffset || document.documentElement.scrollLeft || document.body.scrollLeft || 0,
                yScroll: window.pageYOffset || document.documentElement.scrollTop || document.body.scrollTop || 0
            }
        };
        t.a = function () {
            var e,
                t = void 0 === (e = (0 < arguments.length && void 0 !== arguments[0] ? arguments[0] : {}).waitTime) ? 50 : e,
                n = Object(a.useState)(r()), o = (n = (e = Object(i.a)(n, 2))[0], e[1]);
            return Object(a.useEffect)((function () {
                var e = c()((function () {
                    o(r())
                }), t);
                return window.addEventListener("scroll", e, !0), function () {
                    window.removeEventListener("scroll", e, !0)
                }
            }), [t]), n
        }
    }, 4: function (e, t, n) {
        "use strict";
        var i = "apigkcx", a = "apidata", o = window.location.href.indexOf("gaokao.cn");
        window.location.host;

        function c(e) {
            return "https:/".concat(e)
        }

        var r, s = "".concat(-1 === o ? ".eol.cn" : ".gaokao.cn");
        a = {
            URL: c("/api.zjzw.cn/web/api/"),
            URL_SERVER: c("/api.zjzw.cn/"),
            IMG_URL: "https://static-data.gaokao.cn",
            APP_HTML: c("/static-data.gaokao.cn"),
            APP_UPLOAD: r = c("/static-gkcx.gaokao.cn"),
            APP_UPLOAD_IMG: "https://static-gkcx.gaokao.cn",
            APP_URL_QZD: r,
            DO_MAIN: s,
            VOTE_DATA: a + "/api/gk/school/voteData",
            SCHOOL_HEAT: a + "/api/gk/school/heat",
            SCHOOL_GET_HEAT: a + "/api/gk/school/getheat",
            MAP_CHINA: "/json/chinaData.json",
            LOGIN: i + "/api/user/login",
            SENDCODE: i + "/api/user/sendcode",
            SENDSMS: i + "/api/user/sendsmscode",
            SENDVOICE: i + "/api/user/voicesmscode",
            PROVINCE: a + "/api/data/config/province",
            CITY: a + "/api/data/config/city",
            TOWN: a + "/api/data/config/town",
            SCHOOL_LISTS: a + "/api/gkv3/school/lists",
            PERFECT: i + "/api/user/perfect",
            MODIFY: i + "/api/user/modifyv2",
            USER_GET: i + "/api/user/get",
            SCOREPROVINCE: a + "/api/gk/score/proprovince",
            SCOREPROVINCE1: a + "/api/gk/score/province",
            QUEST: i + "/api/userschool/quest",
            SPECIAL: a + "/api/gk/score/special",
            SPECIAL_DEFAULT: a + "/api/gk/special/school",
            GUFEN_LISTS: i + "/api/school/gufenlists",
            TOTAL_LISTS: i + "/api/school/totallists",
            PLAN_SPECIAL: a + "/api/gkv3/plan/school",
            UPUSERIMG: i + "/api/user/upuserimg",
            CARESCHOOL: i + "/api/userschool/careschool",
            ELECTIVE: a + "/api/gk/schoolSpecial/elective",
            HOTLISTS: i + "/api/school/hotlists",
            HOTSPECIALTY: a + "/api/gk/special/lists",
            SCORESORT: a + "/api/gk/score/province",
            LOGINOUT: i + "/api/user/loginout",
            SPECIAL_LISTS: a + "/api/gkv3/special/lists",
            SPECIAL_SCHOOL: a + "/api/gk/schoolSpecial/lists",
            SCORE_PROFESSION: a + "/api/gk/recomScore/special",
            AD_SCHOOL_LISTS: a + "/api/gk/schoolSpecial/lists",
            LIST_CARE_SPECIAL: i + "/api/userspecial/listcarespecial",
            LIST_CARE_SCHOOL: i + "/api/userschool/listcareschool",
            CARE_SPECIAL: i + "/api/userspecial/carespecial",
            CARE_SCHOOL: i + "/api/userschool/careschool",
            VIDEO_LISTS: i + "/api/gkv3/video/lists",
            COLLECTION_LIST: i + "/api/video/listcarevideo",
            CARE_VIDEO: i + "/api/video/carevideo",
            PCCITY: i + "/api/data/config/city",
            ZYCP: i + "/api/evaluating/evalLogin",
            AQMZYCP: i + "/api/evaluating/secert_pc",
            SECERT: i + "/api/evaluating/secert",
            DEL_USEREVAL: i + "/api/evaluating/delUserEval",
            GETEVAL: i + "/api/evaluating/getEvaluating",
            RECOMMEND_SCHOOL: i + "/api/rank/rankList",
            SCHOOL_GET: a + "/api/gk/school/get",
            SPECIAL_HEAT: a + "/api/gk/special/heat",
            AD_URL: c("/misc.eol.cn/js/target/"),
            GKSJK_STRING: i,
            FLKS: i + "/api/information/lists",
            FLKS_SCHOOL_LIST: i + "/api/school/listssingle",
            GETWEICI: a + "/api/gk/RecomScore/gettotal",
            GZHXSJK_STRING: a,
            STAT_URL: c("/tongji.eol.cn/stat"),
            MNZY_URL: c("/mnzy.gaokao.cn"),
            PLAY_NUM: i + "/api/gkv3/video/heat",
            CONTRAST: a + "/api/gkv3/school/contrast",
            ELECTIVE_ONE_TWO: a + "/api/gk/elective/special",
            ELECTIVE_ONE_TWO_SCHOOL: a + "/api/gkv3/elective/schoollists",
            ELECTIVE_ONE_TWO_SPE: a + "/api/gkv3/elective/schoolspecialdetail",
            ELECTIVE_MAJOR: a + "/api/gkv3/elective/specialdetail_v2",
            SINGLE_PLAN: a + "/api/gkv3/single/plan",
            SINGLE_SCORE: a + "/api/gkv3/single/score",
            SINGLE_SCHOOL: a + "/api/gkv3/single/school",
            SINGLE_NEWS: i + "/api/gkv3/news/datasingle",
            LOG_OFF: i + "/api/user/loginoff",
            NAME_MODIFY: i + "/api/user/modifynickname",
            IS_CARE_SCHOOL: i + "/api/userschool/iscare",
            IS_CARE_SPE: i + "/api/userspecial/iscare",
            FEED_BACK: i + "/api/info/feedback",
            MSG_LIST: i + "/api/info/messlists",
            READ_MSG: i + "/api/info/messchangeread",
            BACK_LISTS: i + "/api/info/feedbacklists",
            DEL_MSG: i + "/api/info/messremove",
            NEW_MSG: i + "/api/info/recentmess",
            FEED_BACK_DETAIL: i + "/api/info/feedbackdetail",
            ALL_READ: i + "/api/info/messallread",
            UN_READ: i + "/api/info/messunread",
            QUESTION_LISTS: i + "/apiv2/zd/lists",
            QUESTION_VIEW: i + "/apiv2/zd/details",
            IS_CARE_KNOWS: i + "/apiv2/zd/iscare",
            CARE_KNOWS: i + "/apiv2/zd/carezd",
            KNOW_READNUM: i + "/apiv2/zd/readnum",
            KNOW_ASK_SUBMIT: i + "/apiv2/zd/quest",
            KNOW_LIKE: i + "/apiv2/zd/likenum",
            MYQUES_LIST: i + "/apiv2/zd/myquestlists",
            COLLECT_QUES_LIST: i + "/apiv2/zd/listcarenews",
            KNOWS_FUZZY_FIND: i + "/apiv2/zd/titleword",
            KNOWS_RIGHT_NEWS: i + "/apiv2/zd/recommendList",
            LIVE_SCHOOL: i + "/api/gkv3/live/liveSchool",
            LIVE_PLAY_BACK: i + "/api/gkv3/live/playback",
            LIVE_PREVIEW: i + "/api/gkv3/live/preview",
            IS_LIVE_ORDER: i + "/api/gkv3/live/listCareLiveId",
            ORDER_LIVE: i + "/api/gkv3/live/careLive",
            SERVER_TIME: i + "/api/gkv3/live/serverTime",
            LIST_CARE_LIVE: i + "/api/gkv3/live/listCareLive",
            LIVE_PREVIEW_REPLY: i + "/api/gkv3/live/aloneLive",
            LIVE_RECOMMEND_SCHOOL: i + "/api/gkv3/live/recommend",
            LIVE_RECOMMEND_TOPIC: i + "/api/gkv3/live/recommendLive",
            WEIXIN_CODE: i + "/api/wxmini/getwxcode",
            WEIXIN_POLLING: i + "/api/user/polling",
            MODIFY_PASSWORD: i + "/api/user/changepassword",
            XYQ_URL: c("/mnzy.gaokao.cn"),
            ZHIJIAO_STATIC: c("/static.zhijiao.cn"),
            ZHIJIAO_DYNAMIC: c("/apiv2.zhijiao.cn"),
            EDA_URL: c("/static-answer.eol.cn"),
            STATIC_TGYY: c("/static-tgyy.zjzw.cn"),
            MODEL_URL: c("/api-chat.zjzw.cn"),
            ART_SCHOOL_LIST: a + "/api/yk/school/lists",
            ART_CULTURE_LISTS: a + "/api/yk/score/artscore",
            ART_TOUDANG_LISTS: a + "/api/yk/score/comscore",
            ART_SCORE_SECTION: a + "/api/yk/score/score_section",
            ART_HOME_NEWS: i + "/api/gkv3/news/lists",
            ART_NEWS_DETAIL: i + "/api/news/getnum",
            GK_NEWS_HOME_LIST: i + "/api/channel/polymerization",
            GK_LIST_HOME_LIST: i + "/api/channel/lists",
            SCHOOL_EXACT_SWITCH: i + "/api/school/exact_switch",
            SCHOOL_EXACT_PHONE: i + "/api/school/exact_phone",
            REPLY_LIVE_HEAT: i + "/api/gkv3/live/heat",
            HOT_SCHOOLLIST: a + "/api/gkv3/school/lists",
            ZB_LIVELISTS: "".concat(i, "/api/gkv3/live/lists"),
            INTERNATION_SCHOOL: "".concat(a, "/api/gkv4/international/school")
        };
        t.a = a
    }
}]);